name: "resnet_preprocessor"
backend: "python"
platform: "python3"

input [
  {
    name: "INPUT__0"
    data_type: TYPE_UINT8
    dims: [ -1, -1, -1 ]
  }
]

output [
  {
    name: "OUTPUT__0"
    data_type: TYPE_FP32
    dims: [-1, 3, 224, 224 ]
  }
]