name: "resnet_ensemble"
platform: "ensemble"

input [
  {
    name: "INPUT__0"
    data_type: TYPE_UINT8
    dims: [ -1, -1, -1 ]
  }
]
output [
  {
    name: "LABELS"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "resnet_preprocessor"
      model_version: -1
      input_map {
        key: "INPUT__0"
        value: "INPUT__0"
      }
      output_map {
        key: "OUTPUT__0"
        value: "OUTPUT_RESNET_PREPROCESSOR__0"
      }
    },
    {
      model_name: "resnet_model"
      model_version: -1
      input_map {
        key: "INPUT__0"
        value: "OUTPUT_RESNET_PREPROCESSOR__0"
      }
      output_map {
        key: "OUTPUT__0"
        value: "OUTPUT_RESNET_MODEL__0"
      }
    },
    {
      model_name: "resnet_postprocessor"
      model_version: -1
      input_map {
        key: "INPUT__0"
        value: "OUTPUT_RESNET_MODEL__0"
      }
      output_map {
        key: "LABELS"
        value: "LABELS"
      }
    }
  ]
}