name: "sentiment"
backend: "python"

input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "label"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "score"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]

instance_group [{ kind: KIND_GPU }]