name: "resnet_postprocessor"
backend: "python"
platform: "python3"

input [
  {
    name: "INPUT__0"
    data_type: TYPE_FP32
    dims: [ -1, 1000 ]
  }
]

output [
  {
    name: "LABELS"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

