name: "resnet_model"
backend: "pytorch"
platform: "pytorch_libtorch"

input [
  {
    name: "INPUT__0"
    data_type: TYPE_FP32
    dims: [-1, 3, 224, 224 ]
  }
]
output [
  {
    name: "OUTPUT__0"
    data_type: TYPE_FP32
    dims: [-1, 1000 ]
  }
]
instance_group [{ kind: KIND_GPU }]
